<?php


return [
    'townships' => [
        'ဧရာဝတီတိုင်းဒေသကြီး' => [
            'name_eng' => 'Aya',
            'districts' => [
                'ပုသိမ်' => [
                    'name_eng' => '',
                    'townships' => [
                        'ကန်ကြီးထောင့်',
                        '‌ကျောင်းကုန်း',
                        'ကျုံပျော်',
                        'ငပုတော',
                        'ပုသိမ်',
                        '​ရေကြည်',
                        'သာပေါင်း',


                    ]
                ],
                'ဟင်္သာတ' => [
                    'name_eng' => '',
                    'townships' => [
                        'ကြံခင်း',
                        'ဇလွန်',
                        'မြန်အောင်',
                        'လေးမျက်နှာ',
                        'ဟင်္သာတ',
                        'အင်္ဂပူ',


                    ]
                ],

                '​မြောင်းမြ' => [
                    'name_eng' => '',
                    'townships' => [
                        '​မြောင်းမြ',
                        'ဝါးခယ်မ',
                        'အိမ်မဲ',


                    ]
                ],

                'လပွတ္တာ' => [
                    'name_eng' => '',
                    'townships' => [
                        'လပွတ္တာ',
                        '​မော်လမြိုင်ကျွန်း',


                    ]
                ],

                'မအူပင်' => [
                    'name_eng' => '',
                    'townships' => [
                        '‌ညောင်တုန်း',
                        'ဓနုဖြူ',
                        'ပန်းတနော်',
                        'မအူပင်',


                    ]
                ],

                'ဖျာပုံ' => [
                    'name_eng' => '',
                    'townships' => [
                        'ကျိုက်လတ်',
                        'ဒေးဒရဲ',
                        'ဖျာပုံ',
                        'ဘိုကလေး',


                    ]
                ],
            ],
        ],

        'ပဲခူးတိုင်းဒေသကြီး' => [
            'name_eng' => 'Bago',
            'districts' => [
                'ပဲခူး' => [
                    'name_eng' => '',
                    'townships' => [
                        'ပဲခူး',
                        'ကဝ',
                        'သနပ်ပင်',
                        'ဝေါ',
                        'ဒိုက်ဦး',
                        '‌ညောင်လေးပင်',
                        '‌ရွှေကျင်',
                        '‌ကျောက်တံခါး',

                    ]
                ],
                '​တောင်ငူ' => [
                    'name_eng' => '',
                    'townships' => [
                        '​တောင်ငူ',
                        '​ရေတာရှည်',
                        'ထန်းတပင်',
                        'အုတ်တွင်း',
                        'ဖြူး',
                        '‌ကျောက်ကြီး',

                    ]
                ],
                'သာယာဝတီ' => [
                    'name_eng' => '',
                    'townships' => [
                        'သာယာဝတီ',
                        'လက်ပံတန်း',
                        'မင်းလှ',
                        'မိုးညို',
                        'အုတ်ဖို',
                        'ကြို့ပင်ကောက်',
                        'ဇီးကုန်း',
                        'နတ်တလင်း',


                    ]
                ],
                'ပြည်' => [
                    'name_eng' => '',
                    'townships' => [
                        'ပေါင်းတည်',
                        'သဲကုန်း',
                        'ရွှေတောင်',
                        'ပန်းတောင်း',
                        'ပေါက်ခေါင်း',
                        'ပြည်',


                    ]
                ],
            ],
        ],

        'ချင်းပြည်နယ်' => [
            'name_eng' => 'Chin',
            'districts' => [
                'ဟားခါး' => [
                    'name_eng' => '',
                    'townships' => [
                        'ဟားခါး',
                        'ထန်တလန်',


                    ]
                ],
                'ဖလမ်း' => [
                    'name_eng' => '',
                    'townships' => [
                        'ဖလမ်း',
                        'ရိခေါဒါရ်',
                        'တီးတိန်',
                        'တွန်းဇံ',
                        'ကျီခါး',


                    ]
                ],

                'မင်းတပ်' => [
                    'name_eng' => '',
                    'townships' => [
                        'မင်းတပ်',
                        'မတူပီ',
                        '‌ရေဇွာ',
                        'ကန်ပက်လက်',
                        'ပလက်ဝ',
                        'ဆမီး',


                    ]
                ],


            ],
        ],

        'ကချင်ပြည်နယ်' => [
            'name_eng' => 'Ka Chin',
            'districts' => [
                'မြစ်ကြီးနား' => [
                    'name_eng' => '',
                    'townships' => [
                        'ချီဖွေ',
                        '​ဆော့လော်',
                        'တနိုင်း',
                        'မြစ်ကြီးနား',
                        'ဝိုင်းမော်',
                        'အင်ဂျန်းယန်',
                    ]
                ],
                'မိုးညှင်း' => [
                    'name_eng' => '',
                    'townships' => [
                        'ဖားကန့်',
                        'မိုးကောင်း',
                        'မိုးညှင်း',
                    ]
                ],
                'ဗန်းမော်' => [
                    'name_eng' => '',
                    'townships' => [
                        'ဗန်းမော်',
                        'မန်စီ',
                        'မိုးမောက်',
                        '​ရွှေကူ',
                    ]
                ],
                'ပူတာအို' => [
                    'name_eng' => '',
                    'townships' => [
                        'ခေါင်လန်ဖူး',
                        'ဆွမ်ပရာဘွမ်',
                        'နောင်မွန်',
                        'ပူတာအို',
                        'မချမ်းဘော့',
                    ]
                ],
            ],
        ],

        'ကယားပြည်နယ်' => [
            'name_eng' => 'Ka Ya',
            'districts' => [
                '‌ဘောလခဲ' => [
                    'name_eng' => '',
                    'townships' => [
                        'ဖားဆောင်း',
                        'ဘောလခဲ',
                        'မယ်စဲ့',
                    ]
                ],
                'လွိုင်ကော်' => [
                    'name_eng' => '',
                    'townships' => [
                        'ဒီးမော့ဆို',
                        'ဖရူဆို',
                        'ရှားတော',
                        'လွိုင်ကော်',
                    ]
                ],
            ],
        ],

        'ကရင်ပြည်နယ်' => [
            'name_eng' => 'Ka Yin',
            'districts' => [
                'ဘားအံ' => [
                    'name_eng' => '',
                    'townships' => [
                        'ဘားအံ',
                        'လှိုင်းဘွဲ',
                        'သံတောင်',
                    ]
                ],
                'ကော့ကရိတ်' => [
                    'name_eng' => '',
                    'townships' => [
                        'ဖာပွန်',
                        'ကော့ကရိတ်',
                        'ကြာအင်းဆိပ်ကြီး',
                    ]
                ],

                'မြဝတီ' => [
                    'name_eng' => '',
                    'townships' => [
                        'မြဝတီ',
                    ]
                ],
            ],
        ],

        'မကွေးတိုင်းဒေသကြီး' => [
            'name_eng' => 'Mague',
            'districts' => [
                'ဂန့်ဂေါ' => [
                    'name_eng' => '',
                    'townships' => [
                        'ဂန့်ဂေါ',
                        'ဆော',
                        'ထီးလင်း',
                    ]
                ],
                'ပခုက္ကူ' => [
                    'name_eng' => '',
                    'townships' => [
                        'ဆိပ်ဖြူ',
                        'ပခုက္ကူ',
                        'ပေါက်',
                        'မြိုင်',
                        '​ရေစကြို',


                    ]
                ],

                'မကွေး' => [
                    'name_eng' => '',
                    'townships' => [
                        '​ချောက်',
                        'တောင်တွင်းကြီး',
                        'နတ်မောက်',
                        'မကွေး',
                        'မြို့သစ်',
                        '‌ရေနံချောင်း',


                    ]
                ],

                'မင်းဘူး' => [
                    'name_eng' => '',
                    'townships' => [
                        'ငဖဲ',
                        'စလင်း',
                        'စေတုတ္တရာ',
                        'ပွင့်ဖြူ',
                        'မင်းဘူး',


                    ]
                ],

                'သရက်' => [
                    'name_eng' => '',
                    'townships' => [
                        'ကံမ',
                        'ဆင်ပေါင်ဝဲ',
                        'မင်းတုန်း',
                        'မင်းလှ',
                        'သရက်',
                        'အောင်လံ',


                    ]
                ],
            ],
        ],

        'မန္တလေးတိုင်းဒေသကြီး' => [
            'name_eng' => 'Mandalay',
            'districts' => [
                'ပြင်ဦးလွင်' => [
                    'name_eng' => '',
                    'townships' => [
                        'စဉ့်ကူး',
                        'ပြင်ဦးလွင်',
                        'မိုးကုတ်',
                        'မတ္တရာမြို့နယ်',
                        'သပိတ်ကျင်း',

                    ]
                ],
                'မြင်းခြံ' => [
                    'name_eng' => '',
                    'townships' => [
                        'ငါန်းဇွန်',
                        'တောင်သာ',
                        'နွားထိုးကြီး',
                        'မြင်းခြံ',

                    ]
                ],

                '​ ညောင်ဦး' => [
                    'name_eng' => '',
                    'townships' => [
                        'ကျောက်ပန်းတောင်း',
                        'ညောင်ဦး',
                        'ညောင်ဦး',
                        'ညောင်ဦး',


                    ]
                ],

                'မိတ္ထီလာ' => [
                    'name_eng' => '',
                    'townships' => [
                        'မလှိုင်',
                        'ဝမ်းတွင်း',
                        'မိတ္ထီလာ',
                        'သာစည်',


                    ]
                ],

                'ရမည်းသင်း' => [
                    'name_eng' => '',
                    'townships' => [
                        'ရမည်းသင်း',
                        '​ပျော်ဘွယ်',


                    ]
                ],

                'မန္တလေး' => [
                    'name_eng' => '',
                    'townships' => [
                        'ချမ်းမြသာစည်',
                        'ချမ်းအေးသာစံ',
                        'ပြည်ကြီးတံခွန်',
                        'မဟာအောင်မြေ',
                        'အောင်မြေသာစံ',
                        'ပုသိမ်ကြီး',
                        'အမရပူရ',
                        'မြစ်ငယ်',


                    ]
                ],

                '​ကျောက်ဆည်' => [
                    'name_eng' => '',
                    'townships' => [
                        'ကျောက်ဆည်',
                        'စဉ့်ကိုင်',
                        'တံတားဦး',
                        'မြစ်သား',


                    ]
                ],
            ],
        ],

        'မွန်ပြည်နယ်' => [
            'name_eng' => 'Mon',
            'districts' => [
                'မော်လမြိုင်' => [
                    'name_eng' => '',
                    'townships' => [
                        'ကျိုက်မရော',
                        'ချောင်းဆုံ',
                        'မုဒုံ',
                        'ကမာ၀က်',
                        'မော်လမြိုင်',
                        'ရေး',
                        'လမိုင်း',
                        'ခေါဇာ',
                        'သံဖြူဇရပ်',
                        'ကျိုက္ခမီ',


                    ]
                ],
                'သထုံ' => [
                    'name_eng' => '',
                    'townships' => [
                        'ကျိုက်ထို',
                        'ပေါင်',
                        'ဇင်းကျိုက်',
                        'ဘီးလင်း',
                        'သထုံ',
                        'သုဝဏ္ဏဝတီ',


                    ]
                ],
            ],
        ],

        'ရခိုင်ပြည်နယ်' => [
            'name_eng' => 'YaKhaing',
            'districts' => [
                'စစ်တွေ' => [
                    'name_eng' => '',
                    'townships' => [
                        'စစ်တွေ',
                        'ပုဏ္ဏားကျွန်း',
                        '​ပေါက်တော',
                        'ရသေ့တောင်',


                    ]
                ],
                'မြောက်ဦး' => [
                    'name_eng' => '',
                    'townships' => [
                        'မြောက်ဦး',
                        'ကျောက်တော်',
                        'မင်းပြား',
                        '​မြေပုံ',


                    ]
                ],

                '​ကျောက်ဖြူ' => [
                    'name_eng' => '',
                    'townships' => [
                        '​ကျောက်ဖြူ',
                        'ရမ်းဗြဲ',
                        'မာန်အောင်',
                        'အမ်း',


                    ]
                ],

                'သံတွဲ' => [
                    'name_eng' => '',
                    'townships' => [
                        'သံတွဲ',
                        '​တောင်ကုတ်',
                        'ဂွ',


                    ]
                ],

                '​မောင်တော' => [
                    'name_eng' => '',
                    'townships' => [
                        '​မောင်တော',
                        'ဘူးသီးတောင်',


                    ]
                ],
            ],
        ],

        'ရှမ်းပြည်နယ်' => [
            'name_eng' => 'Shan(S)',
            'districts' => [
                'တောင်ကြီး' => [
                    'name_eng' => '',
                    'townships' => [
                        'တောင်ကြီး',
                        'ဟိုပုံး',
                        'ညောင်ရွှေ',
                        'ကလော',
                        'ဆီဆိုင်',
                        'ပင်းတယ',
                        'ရွာငံ',
                        'ရပ်စောက်',
                        'ပင်လောင်း',
                        'ဖယ်ခုံ',


                    ]
                ],
                'လွိုင်လင်' => [
                    'name_eng' => '',
                    'townships' => [
                        'လွိုင်လင်',
                        'လဲချား',
                        'ကွန်ဟိန်း',
                        'ကျေးသီး',
                        'မိုင်းကိုင်',
                        'မိုင်းရှူး',
                        'နမ့်စန်(တ)',


                    ]
                ],

                'လင်းခေး' => [
                    'name_eng' => '',
                    'townships' => [
                        'လင်းခေး',
                        'မိုးနဲ',
                        'မောက်မယ်',
                        'မိုင်းပန်',


                    ]
                ],

                'လားရှိုး' => [
                    'name_eng' => '',
                    'townships' => [
                        'လားရှိုး',
                        'သိန်းနီ',
                        'တန့်ယန်း',
                        'ပန်ဆန်း',
                        'မိုင်းရယ်',
                        'ကွမ်းလုံ',

                    ]
                ],
                'မူဆယ်' => [
                    'name_eng' => '',
                    'townships' => [
                        'ဟိုပန်',
                        '​လောက်ကိုင်',
                        'မူဆယ်',
                        'နမ့်ခမ်း',
                        'ကွတ်ခိုင်',

                    ]
                ],
                'ကျောက်မဲ' => [
                    'name_eng' => '',
                    'townships' => [
                        'ကျောက်မဲ',
                        'သီပေါ',
                        'နောင်ချို',
                        'နမ္မတူ',
                        'နမ့်ဆန်',
                        'မန်တုံ',

                    ]
                ],
                'မိုးမိတ်' => [
                    'name_eng' => '',
                    'townships' => [
                        'မိုးမိတ်',
                        'မဘိမ်း',

                    ]
                ],

                'ကျိုင်းတုံ' => [
                    'name_eng' => '',
                    'townships' => [
                        'ကျိုင်းတုံ',
                        'မိုင်းခတ်',
                        'မိုင်းယန်း',
                        'မိုင်းလား',


                    ]
                ],
                'မိုင်းဖြတ်' => [
                    'name_eng' => '',
                    'townships' => [
                        'တာချီလိတ်',
                        'မိုင်းဖြတ်',
                        'မိုင်းယောင်း',


                    ]
                ],

                'မိုင်းဆတ်' => [
                    'name_eng' => '',
                    'townships' => [
                        'မိုင်းပျဉ်း',
                        'မက်မန်း',
                        'မိုင်းဆတ်',
                        'မိုင်းတုံ',


                    ]
                ],

            ],
        ],

        'စစ်ကိုင်းတိုင်းဒေသကြီး' => [
            'name_eng' => 'Sagaing',
            'districts' => [
                'ကလေး' => [
                    'name_eng' => '',
                    'townships' => [
                        'ကလေးမြို့နယ်',
                        'ကလေးဝမြို့နယ်',
                        'မင်းကင်းမြို့နယ်',
                        'တမူးမြို့နယ်',
                    ]
                ],
                'ကသာ' => [
                    'name_eng' => '',
                    'townships' => [
                        'ကသာမြို့နယ်',
                        'ကောလင်းမြို့နယ်',
                        'ထီးချိုင့်မြို့နယ်',
                        'ပင်လည်ဘူးမြို့နယ်',
                        'ဗန်းမောက်မြို့နယ်',
                        'ဝန်းသိုမြို့နယ်',
                        'အင်းတော်မြို့နယ်',
                    ]
                ],

                'ခန္တီး' => [
                    'name_eng' => '',
                    'townships' => [
                        'ခန္တီးမြို့နယ်',
                        'နန်းယွန်းမြို့နယ်',
                        'လဟယ်မြို့နယ်',
                        'လေရှီးမြို့နယ်',
                        'ဟုမ္မလင်းမြို့နယ်',


                    ]
                ],

                'စစ်ကိုင်း' => [
                    'name_eng' => '',
                    'townships' => [
                        'စစ်ကိုင်းမြို့နယ်',
                        'မြင်းမူမြို့နယ်',
                        'မြောင်မြို့နယ်',


                    ]
                ],

                '​မော်လိုက်' => [
                    'name_eng' => '',
                    'townships' => [
                        'မော်လိုက်မြို့နယ်',
                        'ဖောင်းပြင်မြို့နယ်',


                    ]
                ],

                'မုံရွာ' => [
                    'name_eng' => '',
                    'townships' => [
                        'ချောင်းဦးမြို့နယ်',
                        'ဘုတလင်မြို့နယ်',
                        'မုံရွာမြို့နယ်',
                        'အရာတော်မြို့နယ်',

                    ]
                ],

                'ယင်းမာပင်' => [
                    'name_eng' => '',
                    'townships' => [
                        'ကနီမြို့နယ်',
                        'ဆားလင်းကြီးမြို့နယ်',
                        'ပုလဲမြို့နယ်',
                        'ယင်းမာပင်မြို့နယ်',


                    ]
                ],

                '​ရွှေဘို' => [
                    'name_eng' => '',
                    'townships' => [
                        'ခင်ဦးမြို့နယ်',
                        'ဒီပဲယင်းမြို့နယ်',
                        'ရွှေဘိုမြို့နယ်',
                        'ဝက်လက်မြို့နယ်',
                        'ကန့်ဘလူမြို့နယ်',
                        'ကျွန်းလှမြို့နယ်',
                        'တန့်ဆည်မြို့နယ်',
                        'ရေဦးမြို့နယ်',


                    ]
                ],
            ],
        ],

        'တနင်္သာရီတိုင်းဒေသကြီး' => [
            'name_eng' => 'Tanintayi',
            'districts' => [
                'ထားဝယ်' => [
                    'name_eng' => '',
                    'townships' => [
                        'ထားဝယ်',
                        'မေတ္တာ',
                        'ရေဖြူ',
                        'ကလိန်အောင်',
                        'လောင်းလုံး',
                        'သရက်ချောင်း',
                    ]
                ],

                'မြိတ်' => [
                    'name_eng' => '',
                    'townships' => [
                        'ကျွန်းစု',
                        'တနင်္သာရီ',
                        'ပုလော',
                        'ပလောက်',
                        'မြိတ်',

                    ]
                ],

                'ကော့သောင်း' => [
                    'name_eng' => '',
                    'townships' => [
                        'ခမောက်ကြီး',
                        'ကော့သောင်း',
                        'ဘုတ်ပြင်း',
                        'ပြည်ကြီးမဏ္ဍိုင်',
                        'ကရသူရိ',
                    ],
                ],


            ],
        ],

        'ရန်ကုန်တိုင်းဒေသကြီး' => [
            'name_eng' => 'Yangon',
            'districts' => [
                'မြောက်ပိုင်း' => [
                    'name_eng' => '',
                    'townships' => [
                        'အင်းစိန်',
                        'မင်္ဂလာဒုံ',
                        'မှော်ဘီ',
                        'လှည်းကူး',
                        'တိုက်ကြီး',
                        'ထန်းတပင်',
                        'ရွှေပြည်သာ',
                        'လှိုင်သာယာ',


                    ]
                ],
                'အရှေ့ပိုင်း' => [
                    'name_eng' => '',
                    'townships' => [
                        'သင်္ဃန်းကျွန်း',
                        'ရန်ကင်း',
                        '‌တောင်ဥက္ကလာ',
                        'မြောက်ဥက္ကလာ',
                        'သာကေတ',
                        '‌ဒေါပုံ',
                        'တာမွေ',
                        'ပုဇွန်တောင်',
                        'ဗိုလ်တထောင်',
                        'မင်္ဂလာတောင်ညွန့်',
                        'ဒဂုံမြောက်',
                        'ဒဂုံအရှေ့',
                        'ဒဂုံတောင်',
                        'ဒဂုံဆိပ်ကမ်း',


                    ]
                ],

                '‌တောင်ပိုင်း' => [
                    'name_eng' => '',
                    'townships' => [
                        'သန်လျင်',
                        'ကျောက်တန်း',
                        'သုံးခွ',
                        'ခရမ်း',
                        'တွံတေး',
                        'ကွမ်းခြံကုန်း',
                        'ကော့မှူး',
                        'ဒလ',
                        'ခနောင်တို',
                        'ကိုကိုးကျွန်း',


                    ]
                ],

                'အနောက်ပိုင်း' => [
                    'name_eng' => '',
                    'townships' => [
                        '‌ကျောက်တံတား',
                        'လသာ',
                        'ပန်းဘဲတန်း',
                        'အလုံ',
                        'လမ်းမတော်',
                        'ကြည့်မြင်တိုင်',
                        'စမ်းချောင်း',
                        'ကမာရွတ်',
                        'လှိုင်',
                        'မရမ်းကုန်း',
                        'ဗဟန်း',
                        'ဒဂုံ',


                    ]
                ],
            ],
        ],

        'နေပြည်တော် ပြည်ထောင်စုနယ်မြေ' => [
            'name_eng' => 'Naypyitaw',
            'districts' => [
                'ဒက္ခိဏ' => [
                    'name_eng' => '',
                    'townships' => [
                        'ဇမ္ဗူသီရိ',
                        'ဒက္ခိဏသီရိ',
                        'ပျဉ်းမနား',
                        'လယ်ဝေး',


                    ]
                ],
                'ဥတ္တရ' => [
                    'name_eng' => '',
                    'townships' => [
                        '‌ဇေယျာသီရိ',
                        'တပ်ကုန်း',
                        'ပုဗ္ဗသီရိ',
                        'ဥတ္တရသီရိ',


                    ]
                ],
            ],
        ],
    ],
];


